package com.jjf.test;


import net.sourceforge.pinyin4j.PinyinHelper;

import java.util.Map;
import java.util.concurrent.ConcurrentHashMap;

/**
 * 模拟Ca多线程下的解密方式
 *
 * @author jjf_lenovo
 */
public class Test {
    @org.junit.Test
    public void test() {
        String ss = "企业 食品 生鲜果蔬\n" +
                "企业 食品 休闲零食\n" +
                "企业 食品 蛋糕烘培\n" +
                "企业 食品 茶饮酒水\n" +
                "企业 食品 粮油米面\n" +
                "企业 食品 滋补保健\n" +
                "企业 食品 综合食品／食品\n" +
                "企业 餐饮/食品 餐饮\n" +
                "企业 餐饮/食品 餐饮\n" +
                "企业 电商/团购 海淘\n" +
                "企业 电商/团购 \"线上商超\n" +
                "\"\n" +
                "企业 电商/团购 \"团购\n" +
                "\n" +
                "\"\n" +
                "企业 线下零售 \"超市\n" +
                "\n" +
                "\"\n" +
                "企业 线下零售 \"便利店\n" +
                "\n" +
                "\"\n" +
                "企业 线下零售 \"自动贩卖机\n" +
                "\n" +
                "\"\n" +
                "企业 线下零售 \"其他综合零售\n" +
                "\n" +
                "\"\n" +
                "企业 线下零售 日用百货\n" +
                "企业 票务/旅游 旅馆/酒店/度假区\n" +
                "企业 票务/旅游 娱乐票务\n" +
                "企业 票务/旅游 \"交通票务\n" +
                "\n" +
                "\"\n" +
                "企业 票务/旅游 \"景区/宗教\n" +
                "\n" +
                "\"\n" +
                "企业 票务/旅游 \"旅行社\n" +
                "\n" +
                "\"\n" +
                "企业 票务/旅游 旅游服务平台\n" +
                "企业 生活/家居 服饰/箱包/饰品/鞋靴\n" +
                "企业 生活/家居 服饰/箱包/饰品/鞋靴\n" +
                "企业 生活/家居 服饰/箱包/饰品/鞋靴\n" +
                "企业 生活/家居 服饰/箱包/饰品/鞋靴\n" +
                "企业 生活/家居 美妆/护肤\n" +
                "企业 生活/家居 母婴用品/儿童玩具\n" +
                "企业 生活/家居 数码家电/办公设备\n" +
                "企业 生活/家居 家居家纺\n" +
                "企业 生活/家居 家装建材\n" +
                "企业 生活/家居 户外/运动/健身器材/安防\n" +
                "企业 生活/家居 鲜花/盆栽/室内装饰品\n" +
                "企业 生活/家居 交通工具养护/配件/改装\n" +
                "企业 生活/家居 书籍/音像/文具/乐器\n" +
                "企业 生活/家居 宠物/宠物食品/饲料\n" +
                "企业 生活/家居 黄金珠宝/钻石/玉石\n" +
                "企业 生活/家居 钟表/眼镜\n" +
                "企业 生活/家居 计生用品\n" +
                "企业 生活/咨询服务 婚庆/摄影\n" +
                "企业 生活/咨询服务 家政/维修服务\n" +
                "企业 生活/咨询服务 装饰/设计\n" +
                "企业 生活/咨询服务 \"广告/会展/活动策划\n" +
                "\n" +
                "\"\n" +
                "企业 生活/咨询服务 \"咨询/法律咨询/金融咨询等\n" +
                "\n" +
                "\"\n" +
                "企业 生活/咨询服务 \"职业社交/婚介/交友\n" +
                "\n" +
                "\"\n" +
                "企业 生活/咨询服务 \"网上生活服务平台\n" +
                "\n" +
                "\"\n" +
                "企业 生活/咨询服务 \"人才中介机构/招聘/猎头\n" +
                "\n" +
                "\"\n" +
                "企业 教育/培训 教育/培训/考试缴费/学费\n" +
                "企业 教育/培训 \"私立院校\n" +
                "\n" +
                "\"\n" +
                "企业 医疗 保健器械/医疗器械/非处方药品\n" +
                "企业 医疗 \"保健信息咨询平台\n" +
                "\n" +
                "\"\n" +
                "企业 \"医疗\n" +
                "\" \"私立/民营医院/诊所\n" +
                "\n" +
                "\"\n" +
                "企业 医疗 私立/民营医院/诊所\n" +
                "企业 \"医疗\n" +
                "\" \"挂号平台\n" +
                "\n" +
                "\"\n" +
                "企业 网络虚拟服务 在线图书/视频/音乐\n" +
                "企业 网络虚拟服务 \"软件/建站/技术开发\n" +
                "\n" +
                "\"\n" +
                "企业 网络虚拟服务 \"网络推广/网络广告\n" +
                "\n" +
                "\"\n" +
                "企业 \"网络虚拟服务\n" +
                "\" 游戏\n" +
                "企业 \"网络虚拟服务\n" +
                "\" \"门户/资讯/论坛\n" +
                "\n" +
                "\"\n" +
                "企业 娱乐/健身服务 丽人健身／健身瑜伽\n" +
                "企业 娱乐/健身服务 俱乐部/休闲会所\n" +
                "企业 娱乐/健身服务 美甲美睫\n" +
                "企业 娱乐/健身服务 养生保健\n" +
                "企业 娱乐/健身服务 美发\n" +
                "企业 娱乐/健身服务 美容院\n" +
                "企业 娱乐/健身服务 美业综合店（Spa&美发）\n" +
                "企业 娱乐/健身服务 \"健身类会所\n" +
                "\n" +
                "\"\n" +
                "企业 娱乐/健身服务 \"游艺厅/KTV/网吧\n" +
                "\n" +
                "\"\n" +
                "企业 房地产 \"房地产\n" +
                "\n" +
                "\"\n" +
                "企业 收藏/拍卖 \"文物经营/文物复制品销售\n" +
                "\n" +
                "\"\n" +
                "企业 收藏/拍卖 \"拍卖/典当\n" +
                "\n" +
                "\"\n" +
                "企业 收藏/拍卖 \"非文物类收藏品\n" +
                "\n" +
                "\"\n" +
                "企业 \"苗木/绿化\n" +
                "\" \"苗木种植/园林绿化\n" +
                "\n" +
                "\"\n" +
                "企业 \"苗木/绿化\n" +
                "\" \"化肥/农用药剂等\n" +
                "\n" +
                "\"\n" +
                "企业 交通运输服务类 \"物流/快递公司\n" +
                "\n" +
                "\"\n" +
                "企业 交通运输服务类 \"加油\n" +
                "\n" +
                "\"\n" +
                "企业 交通运输服务类 \"港口经营港口理货\n" +
                "\n" +
                "\"\n" +
                "企业 交通运输服务类 \"租车\n" +
                "\n" +
                "\"\n" +
                "企业 生活缴费 \"水电煤缴费/交通罚款等生活缴费\n" +
                "\n" +
                "\"\n" +
                "企业 生活缴费 \"停车缴费\n" +
                "\n" +
                "\"\n" +
                "企业 生活缴费 \"城市交通/高速收费\n" +
                "\n" +
                "\"\n" +
                "企业 生活缴费 \"有线电视缴费\n" +
                "\n" +
                "\"\n" +
                "企业 生活缴费 \"物业管理费\n" +
                "\n" +
                "\"\n" +
                "企业 \"生活缴费\n" +
                "\" \"其他生活缴费\n" +
                "\n" +
                "\"\n" +
                "企业 公益 公益\n" +
                "企业 通讯 \"电信运营商\n" +
                "\n" +
                "\"\n" +
                "企业 通讯 \"宽带收费\n" +
                "\n" +
                "\"\n" +
                "企业 通讯 \"话费通讯\n" +
                "\n" +
                "\"\n" +
                "企业 \"金融\n" +
                "\" \"众筹\n" +
                "\n" +
                "\"\n" +
                "企业 \"金融\n" +
                "\" \"保险业务\n" +
                "\n" +
                "\"\n" +
                "企业 金融 \"财经资讯\n" +
                "\n" +
                "\"\n" +
                "企业 金融 \"股票软件类\n" +
                "\n" +
                "\"\n" +
                "企业 其他 其他行业\n" +
                "企业 其他 其他行业\n" +
                "  \n" +
                "个体 食品 生鲜果蔬\n" +
                "个体 食品 休闲零食\n" +
                "个体 食品 蛋糕烘培\n" +
                "个体 食品 茶饮酒水\n" +
                "个体 食品 粮油米面\n" +
                "个体 食品 滋补保健\n" +
                "个体 食品 综合食品／食品\n" +
                "个体 餐饮/食品 餐饮\n" +
                "个体 餐饮/食品 餐饮\n" +
                "个体 电商/团购 海淘\n" +
                "个体 电商/团购 \"线上商超\n" +
                "\"\n" +
                "个体 电商/团购 \"团购\n" +
                "\n" +
                "\"\n" +
                "个体 线下零售 \"超市\n" +
                "\n" +
                "\"\n" +
                "个体 线下零售 \"便利店\n" +
                "\n" +
                "\"\n" +
                "个体 线下零售 \"自动贩卖机\n" +
                "\n" +
                "\"\n" +
                "个体 线下零售 \"其他综合零售\n" +
                "\n" +
                "\"\n" +
                "个体 线下零售 日用百货\n" +
                "个体 票务/旅游 旅馆/酒店/度假区\n" +
                "个体 票务/旅游 娱乐票务\n" +
                "个体 票务/旅游 \"交通票务\n" +
                "\n" +
                "\"\n" +
                "个体 票务/旅游 \"景区/宗教\n" +
                "\n" +
                "\"\n" +
                "个体 票务/旅游 \"旅行社\n" +
                "\n" +
                "\"\n" +
                "个体 票务/旅游 旅游服务平台\n" +
                "个体 生活/家居 服饰/箱包/饰品/鞋靴\n" +
                "个体 生活/家居 服饰/箱包/饰品/鞋靴\n" +
                "个体 生活/家居 服饰/箱包/饰品/鞋靴\n" +
                "个体 生活/家居 服饰/箱包/饰品/鞋靴\n" +
                "个体 生活/家居 美妆/护肤\n" +
                "个体 生活/家居 母婴用品/儿童玩具\n" +
                "个体 生活/家居 数码家电/办公设备\n" +
                "个体 生活/家居 家居家纺\n" +
                "个体 生活/家居 家装建材\n" +
                "个体 生活/家居 户外/运动/健身器材/安防\n" +
                "个体 生活/家居 鲜花/盆栽/室内装饰品\n" +
                "个体 生活/家居 交通工具养护/配件/改装\n" +
                "个体 生活/家居 书籍/音像/文具/乐器\n" +
                "个体 生活/家居 宠物/宠物食品/饲料\n" +
                "个体 生活/家居 黄金珠宝/钻石/玉石\n" +
                "个体 生活/家居 钟表/眼镜\n" +
                "个体 生活/家居 计生用品\n" +
                "个体 生活/咨询服务 婚庆/摄影\n" +
                "个体 生活/咨询服务 家政/维修服务\n" +
                "个体 生活/咨询服务 装饰/设计\n" +
                "个体 生活/咨询服务 \"广告/会展/活动策划\n" +
                "\n" +
                "\"\n" +
                "个体 生活/咨询服务 \"咨询/法律咨询/金融咨询等\n" +
                "\n" +
                "\"\n" +
                "个体 生活/咨询服务 \"职业社交/婚介/交友\n" +
                "\n" +
                "\"\n" +
                "个体 生活/咨询服务 \"网上生活服务平台\n" +
                "\n" +
                "\"\n" +
                "个体 生活/咨询服务 \"人才中介机构/招聘/猎头\n" +
                "\n" +
                "\"\n" +
                "个体 教育/培训 教育/培训/考试缴费/学费\n" +
                "个体 教育/培训 \"私立院校\n" +
                "\n" +
                "\"\n" +
                "个体 医疗 保健器械/医疗器械/非处方药品\n" +
                "个体 医疗 私立/民营医院/诊所\n" +
                "个体 医疗 \"保健信息咨询平台\n" +
                "\n" +
                "\"\n" +
                "个体 \"医疗\n" +
                "\" \"私立/民营医院/诊所\n" +
                "\n" +
                "\"\n" +
                "个体 \"医疗\n" +
                "\" \"挂号平台\n" +
                "\n" +
                "\"\n" +
                "个体 网络虚拟服务 在线图书/视频/音乐\n" +
                "个体 网络虚拟服务 \"软件/建站/技术开发\n" +
                "\n" +
                "\"\n" +
                "个体 网络虚拟服务 \"网络推广/网络广告\n" +
                "\n" +
                "\"\n" +
                "个体 \"网络虚拟服务\n" +
                "\" 游戏\n" +
                "个体 \"网络虚拟服务\n" +
                "\" \"门户/资讯/论坛\n" +
                "\n" +
                "\"\n" +
                "个体 娱乐/健身服务 俱乐部/休闲会所\n" +
                "个体 娱乐/健身服务 美甲美睫\n" +
                "个体 娱乐/健身服务 养生保健\n" +
                "个体 生活/家居 丽人健身／健身瑜伽\n" +
                "个体 娱乐/健身服务 美发\n" +
                "个体 娱乐/健身服务 美容院\n" +
                "个体 娱乐/健身服务 美业综合店（Spa&美发）\n" +
                "个体 娱乐/健身服务 \"健身类会所\n" +
                "\n" +
                "\"\n" +
                "个体 娱乐/健身服务 \"游艺厅/KTV/网吧\n" +
                "\n" +
                "\"\n" +
                "个体 房地产 \"房地产\n" +
                "\n" +
                "\"\n" +
                "个体 收藏/拍卖 \"文物经营/文物复制品销售\n" +
                "\n" +
                "\"\n" +
                "个体 收藏/拍卖 \"拍卖/典当\n" +
                "\n" +
                "\"\n" +
                "个体 收藏/拍卖 \"非文物类收藏品\n" +
                "\n" +
                "\"\n" +
                "个体 \"苗木/绿化\n" +
                "\" \"苗木种植/园林绿化\n" +
                "\n" +
                "\"\n" +
                "个体 \"苗木/绿化\n" +
                "\" \"化肥/农用药剂等\n" +
                "\n" +
                "\"\n" +
                "个体 交通运输服务类 \"物流/快递公司\n" +
                "\n" +
                "\"\n" +
                "个体 交通运输服务类 \"加油\n" +
                "\n" +
                "\"\n" +
                "个体 交通运输服务类 \"港口经营港口理货\n" +
                "\n" +
                "\"\n" +
                "个体 交通运输服务类 \"租车\n" +
                "\n" +
                "\"\n" +
                "个体 生活缴费 生活缴费\n" +
                "个体 生活缴费 \"水电煤缴费/交通罚款等生活缴费\n" +
                "\n" +
                "\"\n" +
                "个体 生活缴费 \"停车缴费\n" +
                "\n" +
                "\"\n" +
                "个体 生活缴费 \"城市交通/高速收费\n" +
                "\n" +
                "\"\n" +
                "个体 生活缴费 \"有线电视缴费\n" +
                "\n" +
                "\"\n" +
                "个体 生活缴费 \"物业管理费\n" +
                "\n" +
                "\"\n" +
                "个体 \"生活缴费\n" +
                "\" \"其他生活缴费\n" +
                "\n" +
                "\"\n" +
                "个体 公益 公益\n" +
                "个体 通讯 \"电信运营商\n" +
                "\n" +
                "\"\n" +
                "个体 通讯 \"宽带收费\n" +
                "\n" +
                "\"\n" +
                "个体 通讯 \"话费通讯\n" +
                "\n" +
                "\"\n" +
                "个体 \"金融\n" +
                "\" \"众筹\n" +
                "\n" +
                "\"\n" +
                "个体 \"金融\n" +
                "\" \"保险业务\n" +
                "\n" +
                "\"\n" +
                "个体 金融 \"财经资讯\n" +
                "\n" +
                "\"\n" +
                "个体 金融 \"股票软件类\n" +
                "\n" +
                "\"\n" +
                "个体 其他 其他行业\n" +
                "个体 其他 其他行业\n" +
                "  \n" +
                "事业单位 医疗 公立医院\n" +
                "事业单位 医疗 挂号平台\n" +
                "事业单位 教育/培训 公立院校\n" +
                "事业单位 其他生活缴费 水电煤缴费/交通罚款等生活缴费\n" +
                "事业单位 其他生活缴费 事业单位\n" +
                "事业单位 其他生活缴费 停车缴费\n" +
                "事业单位 其他生活缴费 城市交通/高速收费\n" +
                "事业单位 其他生活缴费 物业管理费\n" +
                "事业单位 其他生活缴费 其他生活缴费";
        ss = ss.replace("\"", " ")
                .replace("\n", " ")
                .replace("  ", " ")
                .replace("  ", " ")
                .replace("  ", " ")
                .replace("  ", " ");
        String[] words = ss.split(" ");
        Map map0 = new ConcurrentHashMap<>();
        Map map1 = new ConcurrentHashMap<>();
        Map map2 = new ConcurrentHashMap<>();
        Map map3 = new ConcurrentHashMap<>();

        for (int i = 0; i < words.length; i = i + 3) {
            String oneCode = getOne(map1,words[i],2);
            String twoCode = getOne(map2,words[i+1],3);
            String threeCode = getOne(map3,words[i+2],4);
            System.out.println(getWord(map0,getPinYinHeadChar(words[i + 2])) + "(\""
                    + words[i]+ "\",\""
                    + oneCode + "\",\""
                    + words[i+1]+ "\",\""
                    + twoCode + "\",\""
                    + words[i+2]+ "\",\""
                    + threeCode+ "\",\""
                    + oneCode
                    + twoCode
                    + threeCode+"\"),"
            );
        }
    }

    private String getWord(Map map, String key){
        Object value = map.get(key);
        if (value != null) {
            int num = (int)value+1;
            map.put(key,num);
            return key+autoGenericCode(num,1);
        }
        else{
            map.put(key,0);
            return key;
        }
    }

    public String getOne(Map map, String key,int length) {
        Object value = map.get(key);
        if (value != null) {
            int num = (int)value;
            return autoGenericCode(num,length);
        }
        else{
            int num = map.size()+1;
            map.put(key,num);
            return autoGenericCode(num,length);
        }
    }

    /**
     * 不够位数的在前面补0，保留num的长度位数字
     * @param code
     * @return
     */
    private String autoGenericCode(int code, int length) {
        String result = "";
        result = String.format("%0" + length + "d", code);
        return result;
    }

    /**
     * 获得首字母大写缩写
     *
     * @param str
     * @return
     */
    public static String getPinYinHeadChar(String str) {
        String convert = "";
        for (int j = 0; j < str.length(); j++) {
            char word = str.charAt(j);
            String[] pinyinArray = PinyinHelper.toHanyuPinyinStringArray(word);
            if (pinyinArray != null) {
                convert += pinyinArray[0].charAt(0);
            } else {
                convert += word;
            }
        }
        return convert.replace("/", "").replace("／","")
                .replace("）","")
                .replace("$","")
                .replace("（","")
                .replace("&","").toUpperCase();
    }

}
